
// 歷史股價
const historicalStockPrice = [
// {
// 	date: '2024-11',
// 	price: 186.15
// },

// {
// 	date: '2024-10',
// 	price: 183.9
// },

// {
// 	date: '2024-09',
// 	price: 181.9
// },

// {
// 	date: '2024-08',
// 	price: 185
// },

// {
// 	date: '2024-07',
// 	price: 186.55
// },

// {
// 	date: '2024-06',
// 	price: 168.65
// },

// {
// 	date: '2024-05',
// 	price: 157.35
// },

{
	date: '2024-04',
	price: 158.2
},

{
	date: '2024-03',
	price: 143.55
},

{
	date: '2024-02',
	price: 134.35
},

{
	date: '2024-01',
	price: 135.6
},

{
	date: '2023-12',
	price: 131
},

{
	date: '2023-11',
	price: 122
},

{
	date: '2023-10',
	price: 123.6
},

{
	date: '2023-09',
	price: 125.5
},

{
	date: '2023-08',
	price: 129
},

{
	date: '2023-07',
	price: 129.6
},

{
	date: '2023-06',
	price: 125.35
},

{
	date: '2023-05',
	price: 117.45
},

{
	date: '2023-04',
	price: 120.85
},

{
	date: '2023-03',
	price: 117.3
},

{
	date: '2023-02',
	price: 119.1
},

{
	date: '2023-01',
	price: 109.6
},

{
	date: '2022-12',
	price: 119.2
},

{
	date: '2022-11',
	price: 98.85
},

{
	date: '2022-10',
	price: 102.5
},

{
	date: '2022-09',
	price: 115.5
},

{
	date: '2022-08',
	price: 118.1
},

{
	date: '2022-07',
	price: 115.65
},

{
	date: '2022-06',
	price: 129.3
},

{
	date: '2022-05',
	price: 128.55
},

{
	date: '2022-04',
	price: 136.6
},

{
	date: '2022-03',
	price: 139.05
},

{
	date: '2022-02',
	price: 142.6
},

{
	date: '2022-01',
	price: 146
},

{
	date: '2021-12',
	price: 138.1
},

{
	date: '2021-11',
	price: 136.2
},

{
	date: '2021-10',
	price: 136.3
},

{
	date: '2021-09',
	price: 140.15
},

{
	date: '2021-08',
	price: 137
},

{
	date: '2021-07',
	price: 139
},

{
	date: '2021-06',
	price: 137.2
},

{
	date: '2021-05',
	price: 140.4
},

{
	date: '2021-04',
	price: 135.7
},

{
	date: '2021-03',
	price: 135.5
},

{
	date: '2021-02',
	price: 128.2
},

{
	date: '2021-01',
	price: 122.2
},

{
	date: '2020-12',
	price: 113.8
},

{
	date: '2020-11',
	price: 103.15
},

{
	date: '2020-10',
	price: 103.45
},

{
	date: '2020-09',
	price: 102.45
},

{
	date: '2020-08',
	price: 103.45
},

{
	date: '2020-07',
	price: 89.95
},

{
	date: '2020-06',
	price: 84.45
},

{
	date: '2020-05',
	price: 82.4
},

{
	date: '2020-04',
	price: 76.5
},

{
	date: '2020-03',
	price: 87.5
},

{
	date: '2020-02',
	price: 88.5
},

{
	date: '2020-01',
	price: 97.05
},

{
	date: '2019-12',
	price: 91.95
},

{
	date: '2019-11',
	price: 90
},

{
	date: '2019-10',
	price: 84.8
},

{
	date: '2019-09',
	price: 81.8
},

{
	date: '2019-08',
	price: 82.2
},

{
	date: '2019-07',
	price: 82.05
},

{
	date: '2019-06',
	price: 78.2
},

{
	date: '2019-05',
	price: 82.95
},

{
	date: '2019-04',
	price: 80
},

{
	date: '2019-03',
	price: 77.55
},

{
	date: '2019-02',
	price: 75.35
},

{
	date: '2019-01',
	price: 75.85
},

{
	date: '2018-12',
	price: 77.85
},

{
	date: '2018-11',
	price: 77.85
},

{
	date: '2018-10',
	price: 86.9
},

{
	date: '2018-09',
	price: 86.95
},

{
	date: '2018-08',
	price: 85.8
},

{
	date: '2018-07',
	price: 81.5
},

{
	date: '2018-06',
	price: 80.8
},

{
	date: '2018-05',
	price: 80.05
},

{
	date: '2018-04',
	price: 82.85
},

{
	date: '2018-03',
	price: 81.55
},

{
	date: '2018-02',
	price: 84.75
},

{
	date: '2018-01',
	price: 82.15
},

{
	date: '2017-12',
	price: 82.15
},

{
	date: '2017-11',
	price: 85.35
},

{
	date: '2017-10',
	price: 81.25
},

{
	date: '2017-09',
	price: 82.95
},

{
	date: '2017-08',
	price: 82.15
},

{
	date: '2017-07',
	price: 80.4
},

{
	date: '2017-06',
	price: 76.5
},

{
	date: '2017-05',
	price: 75
},

{
	date: '2017-04',
	price: 73.95
},

{
	date: '2017-03',
	price: 73.1
},

{
	date: '2017-02',
	price: 73.5
},

{
	date: '2017-01',
	price: 71.7
},

{
	date: '2016-12',
	price: 71.6
},

{
	date: '2016-11',
	price: 72.25
},

{
	date: '2016-10',
	price: 71.2
},

{
	date: '2016-09',
	price: 69.3
},

{
	date: '2016-08',
	price: 68.8
},

{
	date: '2016-07',
	price: 65.85
},

{
	date: '2016-06',
	price: 62.95
},

{
	date: '2016-05',
	price: 61.6
},

{
	date: '2016-04',
	price: 64.25
},

{
	date: '2016-03',
	price: 61.25
},

{
	date: '2016-02',
	price: 59.5
},

{
	date: '2016-01',
	price: 60.8
},

{
	date: '2015-12',
	price: 61.7
},

{
	date: '2015-11',
	price: 63.1
},

{
	date: '2015-10',
	price: 62.6
},

{
	date: '2015-09',
	price: 61.9
},

{
	date: '2015-08',
	price: 65.9
},

{
	date: '2015-07',
	price: 69.4
},

{
	date: '2015-06',
	price: 71.1
},

{
	date: '2015-05',
	price: 71.45
},

{
	date: '2015-04',
	price: 68.7
},

{
	date: '2015-03',
	price: 70.3
},

{
	date: '2015-02',
	price: 68.2
},

{
	date: '2015-01',
	price: 66.4
},

{
	date: '2014-12',
	price: 66.3
},

{
	date: '2014-11',
	price: 65.3
},

{
	date: '2014-10',
	price: 65.05
},

{
	date: '2014-09',
	price: 69.25
},

{
	date: '2014-08',
	price: 65.95
},

{
	date: '2014-07',
	price: 65.95
},

{
	date: '2014-06',
	price: 63.15
},

{
	date: '2014-05',
	price: 61.15
},

{
	date: '2014-04',
	price: 60.25
},

{
	date: '2014-03',
	price: 57.8
},

{
	date: '2014-02',
	price: 56.4
},

{
	date: '2014-01',
	price: 58.7
},

{
	date: '2013-12',
	price: 57.6
},

{
	date: '2013-11',
	price: 58
},

{
	date: '2013-10',
	price: 57
},

{
	date: '2013-09',
	price: 55.95
},

{
	date: '2013-08',
	price: 56.55
},

{
	date: '2013-07',
	price: 54.8
},

{
	date: '2013-06',
	price: 56.45
},

{
	date: '2013-05',
	price: 56.35
},

{
	date: '2013-04',
	price: 55.1
},

{
	date: '2013-03',
	price: 55.35
},

{
	date: '2013-02',
	price: 54.7
},

{
	date: '2013-01',
	price: 54
},

{
	date: '2012-12',
	price: 53.55
},

{
	date: '2012-11',
	price: 50.1
},

{
	date: '2012-10',
	price: 55
},

{
	date: '2012-09',
	price: 52.7
},

{
	date: '2012-08',
	price: 50.9
},

{
	date: '2012-07',
	price: 50.5
},

// {
// 	date: '2012-06',
// 	price: 49.85
// },

// {
// 	date: '2012-05',
// 	price: 52.25
// },

// {
// 	date: '2012-04',
// 	price: 54.9
// },

// {
// 	date: '2012-03',
// 	price: 55.95
// },

// {
// 	date: '2012-02',
// 	price: 52.2
// },

// {
// 	date: '2012-01',
// 	price: 49.45
// },

// {
// 	date: '2011-12',
// 	price: 49.6
// },

// {
// 	date: '2011-11',
// 	price: 52.2
// },

// {
// 	date: '2011-10',
// 	price: 50.75
// },

// {
// 	date: '2011-09',
// 	price: 55.05
// },

// {
// 	date: '2011-08',
// 	price: 60.5
// },

// {
// 	date: '2011-07',
// 	price: 59.2
// },

// {
// 	date: '2011-06',
// 	price: 62
// },

// {
// 	date: '2011-05',
// 	price: 62.2
// },

// {
// 	date: '2011-04',
// 	price: 59.6
// },

// {
// 	date: '2011-03',
// 	price: 59.7
// },

// {
// 	date: '2011-02',
// 	price: 63.05
// },

// {
// 	date: '2011-01',
// 	price: 61.6
// },

// {
// 	date: '2010-12',
// 	price: 57.1
// },

// {
// 	date: '2010-11',
// 	price: 56.2
// },

// {
// 	date: '2010-10',
// 	price: 57.9
// },

// {
// 	date: '2010-09',
// 	price: 53.5
// },

// {
// 	date: '2010-08',
// 	price: 54.35
// },

// {
// 	date: '2010-07',
// 	price: 49.55
// },
// {
// 	date: '2010-06',
// 	price: 50
// },
// {
// 	date: '2010-05',
// 	price: 54.5
// },
// {
// 	date: '2010-04',
// 	price: 54.25
// },
// {
// 	date: '2010-03',
// 	price: 51.5
// },
// {
// 	date: '2010-02',
// 	price: 53.15

// },
// {
// 	date: '2010-01',
// 	price: 56.45
// },
]
// 歷史景氣信號、領先景氣信號
const historIndex = [
	{
			"name": "113年9月",
			"a1": 103.35,
			"a2": 34,
			"date": "2024-09"
	},
	{
			"name": "113年8月",
			"a1": 103.28,
			"a2": 39,
			"date": "2024-08"
	},
	{
			"name": "113年7月",
			"a1": 103.14,
			"a2": 35,
			"date": "2024-07"
	},
	{
			"name": "113年6月",
			"a1": 102.79,
			"a2": 38,
			"date": "2024-06"
	},
	{
			"name": "113年5月",
			"a1": 102.28,
			"a2": 36,
			"date": "2024-05"
	},
	{
			"name": "113年4月",
			"a1": 101.63,
			"a2": 35,
			"date": "2024-04"
	},
	{
			"name": "113年3月",
			"a1": 100.95,
			"a2": 31,
			"date": "2024-03"
	},
	{
			"name": "113年2月",
			"a1": 100.35,
			"a2": 29,
			"date": "2024-02"
	},
	{
			"name": "113年1月",
			"a1": 99.85,
			"a2": 27,
			"date": "2024-01"
	},
	{
			"name": "112年12月",
			"a1": 99.39,
			"a2": 22,
			"date": "2023-12"
	},
	{
			"name": "112年11月",
			"a1": 99,
			"a2": 20,
			"date": "2023-11"
	},
	{
			"name": "112年10月",
			"a1": 98.78,
			"a2": 16,
			"date": "2023-10"
	},
	{
			"name": "112年9月",
			"a1": 98.79,
			"a2": 17,
			"date": "2023-09"
	},
	{
			"name": "112年8月",
			"a1": 99.02,
			"a2": 15,
			"date": "2023-08"
	},
	{
			"name": "112年7月",
			"a1": 99.34,
			"a2": 15,
			"date": "2023-07"
	},
	{
			"name": "112年6月",
			"a1": 99.69,
			"a2": 13,
			"date": "2023-06"
	},
	{
			"name": "112年5月",
			"a1": 100.1,
			"a2": 12,
			"date": "2023-05"
	},
	{
			"name": "112年4月",
			"a1": 100.5,
			"a2": 11,
			"date": "2023-04"
	},
	{
			"name": "112年3月",
			"a1": 100.76,
			"a2": 11,
			"date": "2023-03"
	},
	{
			"name": "112年2月",
			"a1": 100.71,
			"a2": 10,
			"date": "2023-02"
	},
	{
			"name": "112年1月",
			"a1": 100.28,
			"a2": 11,
			"date": "2023-01"
	},
	{
			"name": "111年12月",
			"a1": 99.64,
			"a2": 12,
			"date": "2022-12"
	},
	{
			"name": "111年11月",
			"a1": 99.15,
			"a2": 12,
			"date": "2022-11"
	},
	{
			"name": "111年10月",
			"a1": 98.93,
			"a2": 18,
			"date": "2022-10"
	},
	{
			"name": "111年9月",
			"a1": 99.03,
			"a2": 17,
			"date": "2022-09"
	},
	{
			"name": "111年8月",
			"a1": 99.41,
			"a2": 23,
			"date": "2022-08"
	},
	{
			"name": "111年7月",
			"a1": 100.02,
			"a2": 24,
			"date": "2022-07"
	},
	{
			"name": "111年6月",
			"a1": 100.88,
			"a2": 27,
			"date": "2022-06"
	},
	{
			"name": "111年5月",
			"a1": 101.92,
			"a2": 28,
			"date": "2022-05"
	},
	{
			"name": "111年4月",
			"a1": 102.94,
			"a2": 28,
			"date": "2022-04"
	},
	{
			"name": "111年3月",
			"a1": 103.77,
			"a2": 31,
			"date": "2022-03"
	},
	{
			"name": "111年2月",
			"a1": 104.39,
			"a2": 34,
			"date": "2022-02"
	},
	{
			"name": "111年1月",
			"a1": 104.9,
			"a2": 36,
			"date": "2022-01"
	},
	{
			"name": "110年12月",
			"a1": 105.3,
			"a2": 38,
			"date": "2021-12"
	},
	{
			"name": "110年11月",
			"a1": 105.52,
			"a2": 37,
			"date": "2021-11"
	},
	{
			"name": "110年10月",
			"a1": 105.49,
			"a2": 39,
			"date": "2021-10"
	},
	{
			"name": "110年9月",
			"a1": 105.09,
			"a2": 38,
			"date": "2021-09"
	},
	{
			"name": "110年8月",
			"a1": 104.5,
			"a2": 39,
			"date": "2021-08"
	},
	{
			"name": "110年7月",
			"a1": 103.86,
			"a2": 38,
			"date": "2021-07"
	},
	{
			"name": "110年6月",
			"a1": 103.4,
			"a2": 40,
			"date": "2021-06"
	},
	{
			"name": "110年5月",
			"a1": 103.43,
			"a2": 41,
			"date": "2021-05"
	},
	{
			"name": "110年4月",
			"a1": 103.83,
			"a2": 41,
			"date": "2021-04"
	},
	{
			"name": "110年3月",
			"a1": 104.3,
			"a2": 40,
			"date": "2021-03"
	},
	{
			"name": "110年2月",
			"a1": 104.71,
			"a2": 40,
			"date": "2021-02"
	},
	{
			"name": "110年1月",
			"a1": 104.94,
			"a2": 37,
			"date": "2021-01"
	},
	{
			"name": "109年12月",
			"a1": 104.93,
			"a2": 34,
			"date": "2020-12"
	},
	{
			"name": "109年11月",
			"a1": 104.6,
			"a2": 30,
			"date": "2020-11"
	},
	{
			"name": "109年10月",
			"a1": 103.87,
			"a2": 28,
			"date": "2020-10"
	},
	{
			"name": "109年9月",
			"a1": 102.8,
			"a2": 27,
			"date": "2020-09"
	},
	{
			"name": "109年8月",
			"a1": 101.46,
			"a2": 26,
			"date": "2020-08"
	},
	{
			"name": "109年7月",
			"a1": 99.92,
			"a2": 21,
			"date": "2020-07"
	},
	{
			"name": "109年6月",
			"a1": 98.33,
			"a2": 19,
			"date": "2020-06"
	},
	{
			"name": "109年5月",
			"a1": 96.88,
			"a2": 19,
			"date": "2020-05"
	},
	{
			"name": "109年4月",
			"a1": 95.94,
			"a2": 19,
			"date": "2020-04"
	},
	{
			"name": "109年3月",
			"a1": 95.81,
			"a2": 20,
			"date": "2020-03"
	},
	{
			"name": "109年2月",
			"a1": 96.48,
			"a2": 24,
			"date": "2020-02"
	},
	{
			"name": "109年1月",
			"a1": 97.5,
			"a2": 25,
			"date": "2020-01"
	},
	{
			"name": "108年12月",
			"a1": 98.56,
			"a2": 27,
			"date": "2019-12"
	},
	{
			"name": "108年11月",
			"a1": 99.46,
			"a2": 24,
			"date": "2019-11"
	},
	{
			"name": "108年10月",
			"a1": 100.1,
			"a2": 19,
			"date": "2019-10"
	},
	{
			"name": "108年9月",
			"a1": 100.53,
			"a2": 19,
			"date": "2019-09"
	},
	{
			"name": "108年8月",
			"a1": 100.79,
			"a2": 20,
			"date": "2019-08"
	},
	{
			"name": "108年7月",
			"a1": 100.99,
			"a2": 22,
			"date": "2019-07"
	},
	{
			"name": "108年6月",
			"a1": 101.12,
			"a2": 21,
			"date": "2019-06"
	},
	{
			"name": "108年5月",
			"a1": 101.13,
			"a2": 18,
			"date": "2019-05"
	},
	{
			"name": "108年4月",
			"a1": 100.97,
			"a2": 21,
			"date": "2019-04"
	},
	{
			"name": "108年3月",
			"a1": 100.59,
			"a2": 20,
			"date": "2019-03"
	},
	{
			"name": "108年2月",
			"a1": 100.04,
			"a2": 17,
			"date": "2019-02"
	},
	{
			"name": "108年1月",
			"a1": 99.51,
			"a2": 20,
			"date": "2019-01"
	},
	{
			"name": "107年12月",
			"a1": 99.27,
			"a2": 16,
			"date": "2018-12"
	},
	{
			"name": "107年11月",
			"a1": 99.4,
			"a2": 17,
			"date": "2018-11"
	},
	{
			"name": "107年10月",
			"a1": 99.84,
			"a2": 22,
			"date": "2018-10"
	},
	{
			"name": "107年9月",
			"a1": 100.47,
			"a2": 22,
			"date": "2018-09"
	},
	{
			"name": "107年8月",
			"a1": 101.1,
			"a2": 24,
			"date": "2018-08"
	},
	{
			"name": "107年7月",
			"a1": 101.62,
			"a2": 26,
			"date": "2018-07"
	},
	{
			"name": "107年6月",
			"a1": 101.96,
			"a2": 22,
			"date": "2018-06"
	},
	{
			"name": "107年5月",
			"a1": 102.11,
			"a2": 29,
			"date": "2018-05"
	},
	{
			"name": "107年4月",
			"a1": 102.06,
			"a2": 26,
			"date": "2018-04"
	},
	{
			"name": "107年3月",
			"a1": 101.97,
			"a2": 23,
			"date": "2018-03"
	},
	{
			"name": "107年2月",
			"a1": 101.97,
			"a2": 24,
			"date": "2018-02"
	},
	{
			"name": "107年1月",
			"a1": 102.08,
			"a2": 20,
			"date": "2018-01"
	},
	{
			"name": "106年12月",
			"a1": 102.21,
			"a2": 22,
			"date": "2017-12"
	},
	{
			"name": "106年11月",
			"a1": 102.28,
			"a2": 23,
			"date": "2017-11"
	},
	{
			"name": "106年10月",
			"a1": 102.29,
			"a2": 23,
			"date": "2017-10"
	},
	{
			"name": "106年9月",
			"a1": 102.29,
			"a2": 28,
			"date": "2017-09"
	},
	{
			"name": "106年8月",
			"a1": 102.31,
			"a2": 25,
			"date": "2017-08"
	},
	{
			"name": "106年7月",
			"a1": 102.32,
			"a2": 22,
			"date": "2017-07"
	},
	{
			"name": "106年6月",
			"a1": 102.32,
			"a2": 22,
			"date": "2017-06"
	},
	{
			"name": "106年5月",
			"a1": 102.33,
			"a2": 20,
			"date": "2017-05"
	},
	{
			"name": "106年4月",
			"a1": 102.37,
			"a2": 21,
			"date": "2017-04"
	},
	{
			"name": "106年3月",
			"a1": 102.44,
			"a2": 24,
			"date": "2017-03"
	},
	{
			"name": "106年2月",
			"a1": 102.44,
			"a2": 28,
			"date": "2017-02"
	},
	{
			"name": "106年1月",
			"a1": 102.36,
			"a2": 29,
			"date": "2017-01"
	},
	{
			"name": "105年12月",
			"a1": 102.23,
			"a2": 28,
			"date": "2016-12"
	},
	{
			"name": "105年11月",
			"a1": 102.1,
			"a2": 26,
			"date": "2016-11"
	},
	{
			"name": "105年10月",
			"a1": 101.91,
			"a2": 24,
			"date": "2016-10"
	},
	{
			"name": "105年9月",
			"a1": 101.59,
			"a2": 23,
			"date": "2016-09"
	},
	{
			"name": "105年8月",
			"a1": 101.16,
			"a2": 25,
			"date": "2016-08"
	},
	{
			"name": "105年7月",
			"a1": 100.68,
			"a2": 23,
			"date": "2016-07"
	},
	{
			"name": "105年6月",
			"a1": 100.19,
			"a2": 20,
			"date": "2016-06"
	},
	{
			"name": "105年5月",
			"a1": 99.74,
			"a2": 20,
			"date": "2016-05"
	},
	{
			"name": "105年4月",
			"a1": 99.36,
			"a2": 17,
			"date": "2016-04"
	},
	{
			"name": "105年3月",
			"a1": 99.09,
			"a2": 16,
			"date": "2016-03"
	},
	{
			"name": "105年2月",
			"a1": 98.88,
			"a2": 16,
			"date": "2016-02"
	},
	{
			"name": "105年1月",
			"a1": 98.8,
			"a2": 14,
			"date": "2016-01"
	},
	{
			"name": "104年12月",
			"a1": 98.81,
			"a2": 14,
			"date": "2015-12"
	},
	{
			"name": "104年11月",
			"a1": 98.92,
			"a2": 15,
			"date": "2015-11"
	},
	{
			"name": "104年10月",
			"a1": 99.13,
			"a2": 15,
			"date": "2015-10"
	},
	{
			"name": "104年9月",
			"a1": 99.4,
			"a2": 14,
			"date": "2015-09"
	},
	{
			"name": "104年8月",
			"a1": 99.72,
			"a2": 14,
			"date": "2015-08"
	},
	{
			"name": "104年7月",
			"a1": 100.07,
			"a2": 14,
			"date": "2015-07"
	},
	{
			"name": "104年6月",
			"a1": 100.42,
			"a2": 16,
			"date": "2015-06"
	},
	{
			"name": "104年5月",
			"a1": 100.71,
			"a2": 18,
			"date": "2015-05"
	},
	{
			"name": "104年4月",
			"a1": 101,
			"a2": 16,
			"date": "2015-04"
	},
	{
			"name": "104年3月",
			"a1": 101.3,
			"a2": 22,
			"date": "2015-03"
	},
	{
			"name": "104年2月",
			"a1": 101.59,
			"a2": 24,
			"date": "2015-02"
	},
	{
			"name": "104年1月",
			"a1": 101.78,
			"a2": 23,
			"date": "2015-01"
	},
	{
			"name": "103年12月",
			"a1": 101.9,
			"a2": 22,
			"date": "2014-12"
	},
	{
			"name": "103年11月",
			"a1": 102.08,
			"a2": 25,
			"date": "2014-11"
	},
	{
			"name": "103年10月",
			"a1": 102.41,
			"a2": 24,
			"date": "2014-10"
	},
	{
			"name": "103年9月",
			"a1": 102.9,
			"a2": 27,
			"date": "2014-09"
	},
	{
			"name": "103年8月",
			"a1": 103.46,
			"a2": 29,
			"date": "2014-08"
	},
	{
			"name": "103年7月",
			"a1": 103.96,
			"a2": 27,
			"date": "2014-07"
	},
	{
			"name": "103年6月",
			"a1": 104.36,
			"a2": 26,
			"date": "2014-06"
	},
	{
			"name": "103年5月",
			"a1": 104.66,
			"a2": 24,
			"date": "2014-05"
	},
	{
			"name": "103年4月",
			"a1": 104.77,
			"a2": 29,
			"date": "2014-04"
	},
	{
			"name": "103年3月",
			"a1": 104.66,
			"a2": 25,
			"date": "2014-03"
	},
	{
			"name": "103年2月",
			"a1": 104.32,
			"a2": 25,
			"date": "2014-02"
	},
	{
			"name": "103年1月",
			"a1": 103.78,
			"a2": 22,
			"date": "2014-01"
	},
	{
			"name": "102年12月",
			"a1": 103.08,
			"a2": 24,
			"date": "2013-12"
	},
	{
			"name": "102年11月",
			"a1": 102.48,
			"a2": 21,
			"date": "2013-11"
	},
	{
			"name": "102年10月",
			"a1": 102.02,
			"a2": 21,
			"date": "2013-10"
	},
	{
			"name": "102年9月",
			"a1": 101.73,
			"a2": 20,
			"date": "2013-09"
	},
	{
			"name": "102年8月",
			"a1": 101.65,
			"a2": 20,
			"date": "2013-08"
	},
	{
			"name": "102年7月",
			"a1": 101.69,
			"a2": 20,
			"date": "2013-07"
	},
	{
			"name": "102年6月",
			"a1": 101.7,
			"a2": 23,
			"date": "2013-06"
	},
	{
			"name": "102年5月",
			"a1": 101.61,
			"a2": 19,
			"date": "2013-05"
	},
	{
			"name": "102年4月",
			"a1": 101.36,
			"a2": 17,
			"date": "2013-04"
	},
	{
			"name": "102年3月",
			"a1": 100.9,
			"a2": 18,
			"date": "2013-03"
	},
	{
			"name": "102年2月",
			"a1": 100.31,
			"a2": 20,
			"date": "2013-02"
	},
	{
			"name": "102年1月",
			"a1": 99.67,
			"a2": 19,
			"date": "2013-01"
	},
	{
			"name": "101年12月",
			"a1": 99.08,
			"a2": 22,
			"date": "2012-12"
	},
	{
			"name": "101年11月",
			"a1": 98.6,
			"a2": 21,
			"date": "2012-11"
	},
	{
			"name": "101年10月",
			"a1": 98.34,
			"a2": 19,
			"date": "2012-10"
	},
	{
			"name": "101年9月",
			"a1": 98.33,
			"a2": 20,
			"date": "2012-09"
	},
	{
			"name": "101年8月",
			"a1": 98.47,
			"a2": 15,
			"date": "2012-08"
	},
	{
			"name": "101年7月",
			"a1": 98.74,
			"a2": 16,
			"date": "2012-07"
	},
	{
			"name": "101年6月",
			"a1": 99.04,
			"a2": 15,
			"date": "2012-06"
	},
	{
			"name": "101年5月",
			"a1": 99.31,
			"a2": 15,
			"date": "2012-05"
	},
	{
			"name": "101年4月",
			"a1": 99.47,
			"a2": 14,
			"date": "2012-04"
	},
	{
			"name": "101年3月",
			"a1": 99.44,
			"a2": 14,
			"date": "2012-03"
	},
	{
			"name": "101年2月",
			"a1": 99.16,
			"a2": 15,
			"date": "2012-02"
	},
	{
			"name": "101年1月",
			"a1": 98.62,
			"a2": 13,
			"date": "2012-01"
	},
	{
			"name": "100年12月",
			"a1": 98.08,
			"a2": 14,
			"date": "2011-12"
	},
	{
			"name": "100年11月",
			"a1": 98.03,
			"a2": 16,
			"date": "2011-11"
	},
	{
			"name": "100年10月",
			"a1": 98.52,
			"a2": 19,
			"date": "2011-10"
	},
	{
			"name": "100年9月",
			"a1": 99.47,
			"a2": 21,
			"date": "2011-09"
	},
	{
			"name": "100年8月",
			"a1": 100.67,
			"a2": 20,
			"date": "2011-08"
	},
	{
			"name": "100年7月",
			"a1": 101.91,
			"a2": 23,
			"date": "2011-07"
	},
	{
			"name": "100年6月",
			"a1": 103.01,
			"a2": 25,
			"date": "2011-06"
	},
	{
			"name": "100年5月",
			"a1": 103.96,
			"a2": 27,
			"date": "2011-05"
	},
	{
			"name": "100年4月",
			"a1": 104.79,
			"a2": 29,
			"date": "2011-04"
	},
	{
			"name": "100年3月",
			"a1": 105.48,
			"a2": 31,
			"date": "2011-03"
	},
	{
			"name": "100年2月",
			"a1": 105.98,
			"a2": 34,
			"date": "2011-02"
	},
	{
			"name": "100年1月",
			"a1": 106.28,
			"a2": 34,
			"date": "2011-01"
	},
	{
			"name": "99年12月",
			"a1": 106.43,
			"a2": 34,
			"date": "2010-12"
	},
	{
			"name": "99年11月",
			"a1": 106.39,
			"a2": 32,
			"date": "2010-11"
	},
	{
			"name": "99年10月",
			"a1": 106.23,
			"a2": 34,
			"date": "2010-10"
	},
	{
			"name": "99年9月",
			"a1": 106.03,
			"a2": 37,
			"date": "2010-09"
	},
	{
			"name": "99年8月",
			"a1": 105.8,
			"a2": 38,
			"date": "2010-08"
	},
	{
			"name": "99年7月",
			"a1": 105.69,
			"a2": 38,
			"date": "2010-07"
	},
	{
			"name": "99年6月",
			"a1": 105.72,
			"a2": 37,
			"date": "2010-06"
	},
	{
			"name": "99年5月",
			"a1": 105.9,
			"a2": 37,
			"date": "2010-05"
	},
	{
			"name": "99年4月",
			"a1": 106.12,
			"a2": 39,
			"date": "2010-04"
	},
	{
			"name": "99年3月",
			"a1": 106.31,
			"a2": 39,
			"date": "2010-03"
	},
	{
			"name": "99年2月",
			"a1": 106.48,
			"a2": 38,
			"date": "2010-02"
	},
	{
			"name": "99年1月",
			"a1": 106.59,
			"a2": 38,
			"date": "2010-01"
	}
]
// 歷史PMI
const historPmi = [
    {
        "date": "2024-04",
        "pmi": 49.4
    },
    {
        "date": "2024-03",
        "pmi": 47.9
    },
    {
        "date": "2024-02",
        "pmi": 48.1
    },
    {
        "date": "2024-01",
        "pmi": 48
    },
    {
        "date": "2023-12",
        "pmi": 46.8
    },
    {
        "date": "2023-11",
        "pmi": 46.8
    },
    {
        "date": "2023-10",
        "pmi": 47.1
    },
    {
        "date": "2023-09",
        "pmi": 48.2
    },
    {
        "date": "2023-08",
        "pmi": 45.5
    },
    {
        "date": "2023-07",
        "pmi": 46.1
    },
    {
        "date": "2023-06",
        "pmi": 48.3
    },
    {
        "date": "2023-05",
        "pmi": 41.3
    },
    {
        "date": "2023-04",
        "pmi": 42.8
    },
    {
        "date": "2023-03",
        "pmi": 47.3
    },
    {
        "date": "2023-02",
        "pmi": 51.4
    },
    {
        "date": "2023-01",
        "pmi": 40.4
    },
    {
        "date": "2022-12",
        "pmi": 43.7
    },
    {
        "date": "2022-11",
        "pmi": 43.9
    },
    {
        "date": "2022-10",
        "pmi": 45.4
    },
    {
        "date": "2022-09",
        "pmi": 44.9
    },
    {
        "date": "2022-08",
        "pmi": 47.2
    },
    {
        "date": "2022-07",
        "pmi": 47.8
    },
    {
        "date": "2022-06",
        "pmi": 53.6
    },
    {
        "date": "2022-05",
        "pmi": 53.5
    },
    {
        "date": "2022-04",
        "pmi": 56.3
    },
    {
        "date": "2022-03",
        "pmi": 57.8
    },
    {
        "date": "2022-02",
        "pmi": 58.8
    },
    {
        "date": "2022-01",
        "pmi": 56.2
    },
    {
        "date": "2021-12",
        "pmi": 59.3
    },
    {
        "date": "2021-11",
        "pmi": 59.5
    },
    {
        "date": "2021-10",
        "pmi": 58.3
    },
    {
        "date": "2021-09",
        "pmi": 57.8
    },
    {
        "date": "2021-08",
        "pmi": 62.1
    },
    {
        "date": "2021-07",
        "pmi": 65.2
    },
    {
        "date": "2021-06",
        "pmi": 64
    },
    {
        "date": "2021-05",
        "pmi": 66
    },
    {
        "date": "2021-04",
        "pmi": 68.7
    },
    {
        "date": "2021-03",
        "pmi": 62.7
    },
    {
        "date": "2021-02",
        "pmi": 63.2
    },
    {
        "date": "2021-01",
        "pmi": 65.1
    },
    {
        "date": "2020-12",
        "pmi": 61.3
    },
    {
        "date": "2020-11",
        "pmi": 61.2
    },
    {
        "date": "2020-10",
        "pmi": 59.3
    },
    {
        "date": "2020-09",
        "pmi": 57.7
    },
    {
        "date": "2020-08",
        "pmi": 56
    },
    {
        "date": "2020-07",
        "pmi": 54
    },
    {
        "date": "2020-06",
        "pmi": 47.2
    },
    {
        "date": "2020-05",
        "pmi": 44.8
    },
    {
        "date": "2020-04",
        "pmi": 47.6
    },
    {
        "date": "2020-03",
        "pmi": 53.1
    },
    {
        "date": "2020-02",
        "pmi": 52.7
    },
    {
        "date": "2020-01",
        "pmi": 51.3
    },
    {
        "date": "2019-12",
        "pmi": 56.2
    },
    {
        "date": "2019-11",
        "pmi": 54.9
    },
    {
        "date": "2019-10",
        "pmi": 51.1
    },
    {
        "date": "2019-09",
        "pmi": 50
    },
    {
        "date": "2019-08",
        "pmi": 48.2
    },
    {
        "date": "2019-07",
        "pmi": 48
    },
    {
        "date": "2019-06",
        "pmi": 48.1
    },
    {
        "date": "2019-05",
        "pmi": 48.2
    },
    {
        "date": "2019-04",
        "pmi": 51.7
    },
    {
        "date": "2019-03",
        "pmi": 49.1
    },
    {
        "date": "2019-02",
        "pmi": 47.4
    },
    {
        "date": "2019-01",
        "pmi": 46.1
    },
    {
        "date": "2018-12",
        "pmi": 46.5
    },
    {
        "date": "2018-11",
        "pmi": 46.7
    },
    {
        "date": "2018-10",
        "pmi": 51.2
    },
    {
        "date": "2018-09",
        "pmi": 54.6
    },
    {
        "date": "2018-08",
        "pmi": 54.9
    },
    {
        "date": "2018-07",
        "pmi": 55.3
    },
    {
        "date": "2018-06",
        "pmi": 55.8
    },
    {
        "date": "2018-05",
        "pmi": 56.2
    },
    {
        "date": "2018-04",
        "pmi": 56.5
    },
    {
        "date": "2018-03",
        "pmi": 56.1
    },
    {
        "date": "2018-02",
        "pmi": 58.7
    },
    {
        "date": "2018-01",
        "pmi": 59.7
    },
    {
        "date": "2017-12",
        "pmi": 60.2
    },
    {
        "date": "2017-11",
        "pmi": 60.1
    },
    {
        "date": "2017-10",
        "pmi": 58.9
    },
    {
        "date": "2017-09",
        "pmi": 59
    },
    {
        "date": "2017-08",
        "pmi": 58.9
    },
    {
        "date": "2017-07",
        "pmi": 60
    },
    {
        "date": "2017-06",
        "pmi": 54.8
    },
    {
        "date": "2017-05",
        "pmi": 56.3
    },
    {
        "date": "2017-04",
        "pmi": 58.4
    },
    {
        "date": "2017-03",
        "pmi": 61
    },
    {
        "date": "2017-02",
        "pmi": 63.7
    },
    {
        "date": "2017-01",
        "pmi": 53.1
    },
    {
        "date": "2016-12",
        "pmi": 55.9
    },
    {
        "date": "2016-11",
        "pmi": 59.1
    },
    {
        "date": "2016-10",
        "pmi": 57.5
    },
    {
        "date": "2016-09",
        "pmi": 56.5
    },
    {
        "date": "2016-08",
        "pmi": 55.5
    },
    {
        "date": "2016-07",
        "pmi": 53.8
    },
    {
        "date": "2016-06",
        "pmi": 52.4
    },
    {
        "date": "2016-05",
        "pmi": 52.3
    },
    {
        "date": "2016-04",
        "pmi": 50.8
    },
    {
        "date": "2016-03",
        "pmi": 47.1
    },
    {
        "date": "2016-02",
        "pmi": 48.3
    },
    {
        "date": "2016-01",
        "pmi": 49.6
    },
    {
        "date": "2015-12",
        "pmi": 48.7
    },
    {
        "date": "2015-11",
        "pmi": 48.2
    },
    {
        "date": "2015-10",
        "pmi": 47.6
    },
    {
        "date": "2015-09",
        "pmi": 46.8
    },
    {
        "date": "2015-08",
        "pmi": 47
    },
    {
        "date": "2015-07",
        "pmi": 48.3
    },
    {
        "date": "2015-06",
        "pmi": 48.6
    },
    {
        "date": "2015-05",
        "pmi": 48.8
    },
    {
        "date": "2015-04",
        "pmi": 49.8
    },
    {
        "date": "2015-03",
        "pmi": 51.5
    },
    {
        "date": "2015-02",
        "pmi": 53.7
    },
    {
        "date": "2015-01",
        "pmi": 53.4
    },
    {
        "date": "2014-12",
        "pmi": 52.5
    },
    {
        "date": "2014-11",
        "pmi": 52.8
    },
    {
        "date": "2014-10",
        "pmi": 53.3
    },
    {
        "date": "2014-09",
        "pmi": 54
    },
    {
        "date": "2014-08",
        "pmi": 56
    },
    {
        "date": "2014-07",
        "pmi": 58.5
    },
    {
        "date": "2014-06",
        "pmi": 57.2
    },
    {
        "date": "2014-05",
        "pmi": 56.4
    },
    {
        "date": "2014-04",
        "pmi": 56.5
    },
    {
        "date": "2014-03",
        "pmi": 56.2
    },
    {
        "date": "2014-02",
        "pmi": 56
    },
    {
        "date": "2014-01",
        "pmi": 53.8
    },
    {
        "date": "2013-12",
        "pmi": 54
    },
    {
        "date": "2013-11",
        "pmi": 54.5
    },
    {
        "date": "2013-10",
        "pmi": 53.8
    },
    {
        "date": "2013-09",
        "pmi": 54.5
    },
    {
        "date": "2013-08",
        "pmi": 53.3
    },
    {
        "date": "2013-07",
        "pmi": 52.8
    },
    {
        "date": "2013-06",
        "pmi": 52.8
    },
    {
        "date": "2013-05",
        "pmi": 53
    },
    {
        "date": "2013-04",
        "pmi": 53
    },
    {
        "date": "2013-03",
        "pmi": 52.9
    },
    {
        "date": "2013-02",
        "pmi": 54.5
    },
    {
        "date": "2013-01",
        "pmi": 55.9
    },
    {
        "date": "2012-12",
        "pmi": 55
    },
    {
        "date": "2012-11",
        "pmi": 51.7
    },
    {
        "date": "2012-10",
        "pmi": 49.3
    },
    {
        "date": "2012-09",
        "pmi": 49.9
    },
    {
        "date": "2012-08",
        "pmi": 48.2
    },
    {
        "date": "2012-07",
        "pmi": 47.1
    }
]
// console.log(historicalStockPrice, 'arr')
const myStock = {
	currentMoney: 0, // 當前存款
	eachBuyingAmount: 100, // 每次買入金額
	buyingCount: 0, // 買入次數
	notBuyingCount: 0, // 沒買入次數

	totalStockCount: 0, // 總買入股數
	totalBuyingAmount: 0, // 總買入成本
	buyingAveragePrice: 0, // 總買入平均價格 = 總買入成本 / 總買入股數
	totalMarketValue: 0, // 總市值 用股價100代替
}


const findHistorIndex = (date) => {
	const index = historIndex.findIndex(item => item.date === date)
	
	// 邊界處理
	if (index === historIndex.length - 1) {
		return null
	} else {
		// 落後一個月 現實
		return historIndex[index + 1]
		// 同步指標 理想
		// return historIndex[index] 
	}
}

const findPmiHistorIndex = (date) => {
	const index = historPmi.findIndex(item => item.date === date)
	
	// 邊界處理
	if (index === historPmi.length - 1) {
		return null
	} else {
		// 落後一個月 現實
		return historPmi[index + 1]
		// 同步指標 理想
		// return historPmi[index] 
	}
}

// 定期定額計算
const calculateMonthlyInvestment = () => {
	historicalStockPrice.forEach((item) => {
		const stockCount = myStock.eachBuyingAmount / item.price // 買入股數
		myStock.totalStockCount += stockCount // 總買入股數
		myStock.totalBuyingAmount += myStock.eachBuyingAmount // 總買入成本
		
		myStock.buyingCount += 1 // 總買入股數
	})
	myStock.buyingAveragePrice = myStock.totalBuyingAmount / myStock.totalStockCount // 總買入平均價格
	myStock.totalMarketValue = myStock.totalStockCount * 100 // 總買入平均價格
	
}

// 景氣信號投資法
const calculateMonthlyInvestment2 = () => {
	const priceLog = []
	historicalStockPrice.forEach((item) => {
		const findIndex = findHistorIndex(item.date)
		const findPmiIndex = findPmiHistorIndex(item.date)
		console.log('findPmiIndex', findPmiIndex)
		// if (findIndex && (findIndex.a2 < 17 && findIndex.a1 < 100))

		if (findPmiIndex && findPmiIndex.pmi < 45) {
			// 每次買入％數
			const buyPrice = myStock.currentMoney * 0.1
			myStock.currentMoney = myStock.currentMoney - buyPrice

			const stockCount = buyPrice / item.price // 買入股數
			myStock.totalStockCount += stockCount // 總買入股數
			myStock.totalBuyingAmount += buyPrice // 總買入成本


			myStock.buyingCount += 1
			priceLog.push({
				priceDate: item.date,
				indexDate: findIndex.date,
				pmiIndexDate: findPmiIndex.date,
				price: item.price,
				pmi: findPmiIndex.pmi,
				a1: findIndex.a1,
				a2: findIndex.a2,
				buyPrice: buyPrice,
				currentMoney: myStock.currentMoney
			})
		} else {
			myStock.currentMoney += 100
			myStock.notBuyingCount += 1

		}

	})
	console.log(priceLog)
	myStock.buyingAveragePrice = myStock.totalBuyingAmount / myStock.totalStockCount // 總買入平均價格
	myStock.totalMarketValue = myStock.totalStockCount * 100 // 總買入平均價格
	
}

calculateMonthlyInvestment2()

console.log('當前存款', myStock.currentMoney)
console.log('買入次數', myStock.buyingCount)
console.log('沒買入次數', myStock.notBuyingCount)
console.log('總買入金額', myStock.totalBuyingAmount)
console.log('總買入股數', myStock.totalStockCount)
console.log('總買入平均價格', myStock.buyingAveragePrice)
console.log('總市值', myStock.totalMarketValue)

